# Olmayan Verilerlerle İlgleneme

In [59]:
import pandas as pd
import numpy as np

In [4]:
sozlukVerisi = {"İstanbul": [30,29,np.nan],"Ankara": [20,np.nan,25],"İzmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [5]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

## Direkt Atma (olmayan verileri) [x.dropna(axis = 0,1)]

##### Bir Satır veya Sütünda 'eksik veri, nan' varsa; o sütun ya da satır direkt iptal olur.

In [9]:
havaDurumuDataFrame.dropna()

   İstanbul  Ankara  İzmir
0      30.0    20.0     40

### Dropna() geçicidir, kalıcı olması için 'inplace' gereklidir

In [10]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [12]:
havaDurumuDataFrame.dropna(axis = 1) ## axis kullanımı

   İzmir
0     40
1     39
2     38

In [61]:
yeniVeri = {"İstanbul": [30,29,np.nan],"Ankara": [20,np.nan,25],"İzmir": [40,39,38],"Antalya": [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [62]:
yeniDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [63]:
yeniDataFrame.index.name = "Indexler"

In [64]:
yeniDataFrame["x"] = ["P","S","Ç"]

In [65]:
yeniDataFrame

          İstanbul  Ankara  İzmir  Antalya  x
Indexler
0             30.0    20.0     40     45.0  P
1             29.0     NaN     39      NaN  S
2              NaN    25.0     38      NaN  Ç

In [66]:
yeniDataFrame.set_index("x")

   İstanbul  Ankara  İzmir  Antalya
x
P      30.0    20.0     40     45.0
S      29.0     NaN     39      NaN
Ç       NaN    25.0     38      NaN

In [67]:
yeniDataFrame

          İstanbul  Ankara  İzmir  Antalya  x
Indexler
0             30.0    20.0     40     45.0  P
1             29.0     NaN     39      NaN  S
2              NaN    25.0     38      NaN  Ç

In [68]:
yeniDataFrame.drop("x", axis = 1)

          İstanbul  Ankara  İzmir  Antalya
Indexler
0             30.0    20.0     40     45.0
1             29.0     NaN     39      NaN
2              NaN    25.0     38      NaN

In [69]:
yeniDataFrame

          İstanbul  Ankara  İzmir  Antalya  x
Indexler
0             30.0    20.0     40     45.0  P
1             29.0     NaN     39      NaN  S
2              NaN    25.0     38      NaN  Ç

In [70]:
yeniDataFrame.drop("x",axis = 1, inplace = True)

In [71]:
yeniDataFrame

          İstanbul  Ankara  İzmir  Antalya
Indexler
0             30.0    20.0     40     45.0
1             29.0     NaN     39      NaN
2              NaN    25.0     38      NaN

In [72]:
yeniDataFrame["Gunler"] = ["Pazartesi","Salı","Çarşamba"]

In [73]:
yeniDataFrame

          İstanbul  Ankara  İzmir  Antalya     Gunler
Indexler
0             30.0    20.0     40     45.0  Pazartesi
1             29.0     NaN     39      NaN       Salı
2              NaN    25.0     38      NaN   Çarşamba

In [74]:
yeniDataFrame

          İstanbul  Ankara  İzmir  Antalya     Gunler
Indexler
0             30.0    20.0     40     45.0  Pazartesi
1             29.0     NaN     39      NaN       Salı
2              NaN    25.0     38      NaN   Çarşamba

In [75]:
yeniDataFrame.set_index("Gunler")

           İstanbul  Ankara  İzmir  Antalya
Gunler
Pazartesi      30.0    20.0     40     45.0
Salı           29.0     NaN     39      NaN
Çarşamba        NaN    25.0     38      NaN

## 'dropna' (eksik,nan) alt limiti belirleme

In [80]:
yeniDataFrame.dropna(axis=1,thresh =2)

          İstanbul  Ankara  İzmir
Indexler
0             30.0    20.0     40
1             29.0     NaN     39
2              NaN    25.0     38

In [81]:
yeniDataFrame

          İstanbul  Ankara  İzmir  Antalya
Indexler
0             30.0    20.0     40     45.0
1             29.0     NaN     39      NaN
2              NaN    25.0     38      NaN

## Boş,Eksik,NaN Verileri Otomatik Doldurma

In [82]:
yeniDataFrame.fillna(20)

          İstanbul  Ankara  İzmir  Antalya
Indexler
0             30.0    20.0     40     45.0
1             29.0    20.0     39     20.0
2             20.0    25.0     38     20.0

# groupby

## Groupby için Veri Üretiyoruz

In [83]:
maasSozlugu = {"Departmanlar": ["Yazılım","Satış","Pazarlama","Finans","İnsan Kayankları","Hukuk Departmanı"],
              "Çalışan İsmi": ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
              "Maaş": [100,150,200,300,400,500]}

In [84]:
maasSozlugu

{'Departmanlar': ['Yazılım',
  'Satış',
  'Pazarlama',
  'Finans',
  'İnsan Kayankları',
  'Hukuk Departmanı'],
 'Çalışan İsmi': ['Ahmet', 'Mehmet', 'Atil', 'Burak', 'Zeynep', 'Fatma'],
 'Maaş': [100, 150, 200, 300, 400, 500]}

In [85]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [86]:
maasDataFrame

       Departmanlar Çalışan İsmi  Maaş
0           Yazılım        Ahmet   100
1             Satış       Mehmet   150
2         Pazarlama         Atil   200
3            Finans        Burak   300
4  İnsan Kayankları       Zeynep   400
5  Hukuk Departmanı        Fatma   500

## GroupBy için verilerimizde düznlemeye gittik.

In [87]:
maasSozlugu = {"Departmanlar": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Çalışan İsmi": ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
              "Maaş": [100,150,200,300,400,500]}

In [88]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [89]:
maasDataFrame

  Departmanlar Çalışan İsmi  Maaş
0      Yazılım        Ahmet   100
1      Yazılım       Mehmet   150
2    Pazarlama         Atil   200
3    Pazarlama        Burak   300
4        Hukuk       Zeynep   400
5        Hukuk        Fatma   500

In [90]:
maasDataFrame.groupby("Departmanlar")

## groupby IN ACTION

In [98]:
maasDataFrame

  Departmanlar Çalışan İsmi  Maaş
0      Yazılım        Ahmet   100
1      Yazılım       Mehmet   150
2    Pazarlama         Atil   200
3    Pazarlama        Burak   300
4        Hukuk       Zeynep   400
5        Hukuk        Fatma   500

In [91]:
grupObjesi = maasDataFrame.groupby("Departmanlar")

In [92]:
grupObjesi.count()

              Çalışan İsmi  Maaş
Departmanlar
Hukuk                    2     2
Pazarlama                2     2
Yazılım                  2     2

In [93]:
grupObjesi.mean()

               Maaş
Departmanlar
Hukuk         450.0
Pazarlama     250.0
Yazılım       125.0

In [94]:
grupObjesi.min()

             Çalışan İsmi  Maaş
Departmanlar
Hukuk               Fatma   400
Pazarlama            Atil   200
Yazılım             Ahmet   100

In [95]:
grupObjesi.max()

             Çalışan İsmi  Maaş
Departmanlar
Hukuk              Zeynep   500
Pazarlama           Burak   300
Yazılım            Mehmet   150

In [96]:
grupObjesi.describe()

              Maaş
             count   mean        std    min    25%    50%    75%    max
Departmanlar
Hukuk          2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama      2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım        2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0